OneAI/src/DataProcessors/NeuronetTraining/NeuronetTraining.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>NeuronetTraining</name>
  <comment>by back propagation method</comment>
  <attributes>
    <name>Neuronet</name>
    <type>
      <types>CatalogRef.Neuronets</types>
    </type>
  </attributes>
  <attributes>
    <name>DataSet</name>
    <type>
      <types>CatalogRef.TrainingDataSets</types>
    </type>
  </attributes>
  <attributes>
    <name>Speed</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StepsQty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>DataSets</name>
    <attributes>
      <name>DataSet</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>InputNeurons</name>
    <attributes>
      <name>Neuron</name>
      <type>
        <types>CatalogRef.Neurons</types>
      </type>
    </attributes>
    <attributes>
      <name>Active</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Result</name>
    <attributes>
      <name>Neuron</name>
      <type>
        <types>CatalogRef.Neurons</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

OneAI/src/DataProcessors/NeuronetTraining/Forms/Workplace/Module.bsl
#Region FormHeaderItemsEventHandlers

&AtClient
Async Procedure NeuronetStartChoice(Item, ChoiceData, StandardProcessing)
	OnStartChoice(StandardProcessing);
EndProcedure

&AtClient
Procedure NeuronetOnChange(Item)
	If ValueIsFilled(Object.Neuronet) Then
		CountOfLayers = CommonFunctionalityAIServerCall.GetCountOfLayers(Object.Neuronet);
		If CountOfLayers < 3 Then
			MessageTemplate = NStr("en = 'Your neuronet has only %1 layers. It must be minimum 3. Add a new layer and try again.'");
			MessageText = StrTemplate(MessageTemplate, CountOfLayers);
			Message(MessageText);
			Object.Neuronet = Undefined;
			ClearTabularParts();
		EndIf;
	Else
		ClearTabularParts();
	EndIf;
EndProcedure

&AtClient
Procedure NeuronetClearing(Item, StandardProcessing)
	OnClearing(StandardProcessing);
EndProcedure

&AtClient
Procedure DataSetOnChange(Item)
	ClearTabularParts();
	
	If ValueIsFilled(Object.DataSet) Then
		LoadTabularPartsFromDataSet();
	EndIf;
EndProcedure

&AtClient
Procedure DataSetClearing(Item, StandardProcessing)
	OnClearing(StandardProcessing);
EndProcedure

&AtClient
Procedure DataSetStartChoice(Item, ChoiceData, StandardProcessing)
	OnStartChoice(StandardProcessing);
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure ClearTabularParts()
	Object.DataSets.Clear();
	Object.InputNeurons.Clear();
	Object.Result.Clear();
EndProcedure

&AtServer
Procedure LoadTabularPartsFromDataSet()
	Object.DataSets.Load(Object.DataSet.DataSets.Unload());
	Object.InputNeurons.Load(Object.DataSet.InputNeurons.Unload());
	Object.Result.Load(Object.DataSet.Result.Unload());
EndProcedure

&AtClient
Procedure OnClearing(StandardProcessing)
	If Object.DataSets.Count() > 1 Then
		Answer = DoQueryBoxAsync(NStr("en = 'Tabular parts will be cleared. Continue?'"), QuestionDialogMode.YesNo);
		If Answer = DialogReturnCode.No Then
			StandardProcessing = False;
		Else
			ClearTabularParts();
		EndIf;
	EndIf;
EndProcedure

&AtClient
Procedure OnStartChoice(StandardProcessing)
	If Object.DataSets.Count() > 0 Then
		Answer = DoQueryBoxAsync(NStr("en = 'Tabular parts will be cleared. Continue?'"), QuestionDialogMode.YesNo);
		If Answer = DialogReturnCode.No Then
			StandardProcessing = False;
		Else
			ClearTabularParts();
		EndIf;
	EndIf;
EndProcedure

#EndRegion
